{"pages":[{"title":"","text":"1a6f6bec81762ea439982c4bf31304be","link":"/baidu_verify_code-Bxwflx7H44.html"},{"title":"","text":"google-site-verification: googlee0783c4287f20390.html","link":"/googlee0783c4287f20390.html"},{"title":"CURRICULUM VITAE","text":"Personal InformationName: Wenkai Yan 闫文凯 Gender: Male Nationality: Chinese Data of birth: 17/10/1990 Address: College of Agriculture, Nanjing Agricultural University. No.1, Weigang, Xuanwu District, Nanjing, Jiangsu, China Mobile Phone: +86 15996238021 E-mail: 2017201007@njau.edu.cn Education2017.9-present Nanjing Agricultural University, Nanjing, China ​ Ph.D. student ​ Major: Bioinformatics 2014.9-2017.6 Nanjing Agricultural University, Nanjing, China ​ Postgraduate student ​ Major: Mathematics 2010.9-2014.6 Henan University of Science and Technology, Henan, China ​ Bachelor ​ Major: Food Science and Engineering Research Interest2017.9-present: Ph.D. research Current research contents: (1) Learn epigenetic knowledge, experimental methods, and analysis methods for NGS data; (2) Analysis the muskmelon transcriptome data and its GWAS data;(3) Learn more knowledge about machine learning, deep learning algorithms and use these algorithms to solve biological problems. 2014.9-2017.6: postgraduate research Thesis title: The study of identification pathogenic SNP based on feature selection Research contents: This paper proposes lots of methods based on feature selection algorithm, such as Random Forest algorithm, PSO-GA-SVM, to identify pathogenic SNP. These methods not only consider the main effect of the single point, but also the interaction effect between multiple sites. In addition, researchers can adjust the methods according to the demand, so our methods are flexible and extendable. Thesis title: Recognition of 16S rRNA genes in prokaryotic genomes Research contents: We constructed a 3-layer filtering model based on the three features of GC bases content of the gene sequences, 3-base periodicity and Markov chain to recognize the 16S rRNA genes from prokaryotic genomes. The specificity, sensitivity and Matthews correlation coefficients of the model were 99.58%, 91.60% and 91.49%, respectively. Experience2015.9.18-2015.9.22 National Post-Graduate Mathematical Contest in Modeling Throughout the competition process, I served as team leader. During this period, I performed the duties to organize the classmates for a variety of aspects such as experimental proposals, task assignment, data processing, and providing a pleasant environment to team members. Publications Wenkai Yan, Mingmin Xu, Guangle Zhang, Ning Qiao, Weina Xu, Yuanyuan Chen, Liangyun Zhang (2017). Recognition of 16S rRNA genes in prokaryotic genomes. Acta Microbiologica Sinica. Honors and Awards2017 PhD Degree Candidate Academic Scholarship -The second prize 2017 Excellent Postgraduate Student Cadres 2016 Master Degree Candidate Academic Scholarship -The first prize 2015 National Post-Graduate Mathematical Contest in Modeling -The third prize Professional Skills Team work spirit Good in Machine learning, Computer Programming, NGS data analysis Good in English reading, writing, speaking, and analytical thinking Proficient in statistical analysis Good in scientific writing ReferencesSupervisor: Prof. Yufeng Wu. College of agriculture, Nanjing Agricultural University, Nanjing 210095, China Email address: yfwu@njau.edu.cn Tel.(office): +86 (0)25 8439 9042 Cell phone: +86 13951855057","link":"/Resume/index.html"}],"posts":[{"title":"Hexo优化：提交sitemap","text":"1. 前言当个人的博客搭建起来后，此时通过关键词在搜索引擎上是查询不到的，只有等到百度或谷歌爬取到你的网页后才会把你的网页进行收录。通常，等着各大网站自动收录的时间通常需要较长的时间。因此，我们需要手动向搜引擎提交自己的网页地址，提供他们更为方便的爬取相应的内容，是别人更容易搜索到。 本文主要有以下内容： 1、链接优化 2、stiemap的生成 3、网站的验证 4、stiemap的提交 2. 验证博客是否被收录在谷歌或百度的搜索链接中，使用以下方式来进行判断，如果能搜索到就说明已经被收录，反之则没有。 1site:https://wenkaiyan-kevin.github.io/ 3. 优化网页链接hexo默认生成的页面链接是一串很长的字符，这样是很不利于搜索引擎收录的，那么为了让我我们的网页更快的被收录，我们可以使用插件来解决这个问题。 安装缩短链接插件 1npm install hexo-abbrlink --save 然后更改你博客目录下的_config.yml文件，添加如下配置： 12345678permalink: posts/:abbrlink.htmlabbrlink: alg: crc32 # 算法：crc16(default) and crc32 rep: hex # 进制：dec(default) and hexpermalink_defaults:pretty_urls: trailing_index: true # Set to false to remove trailing 'index.html' from permalinks trailing_html: true # Set to false to remove trailing '.html' from permalinks 安装完毕后此时再hexo clean &amp;&amp; hexo g会发现生成的网页名称不再是一长串字符，而是固定的字符串，访问路径也统一变成了posts/xxx.html，这种简单的访问路径比较利于搜索引擎收录。 4. 添加robots.txt robots.txt（统一小写）是一种存放于网站根目录下的 ASCII 编码的文本文件，它通常告诉网络搜索引擎的漫游器（又称网络蜘蛛），此网站中的哪些内容是不应被搜索引擎的漫游器获取的，哪些是可以被漫游器获取的。 在 source 目录下增加 robots.txt 文件， 我的 robots.txt 代码如下，请将域名改为自己的网站 123# hexo robots.txtUser-agent: *Allow: / 这样在下次部署博客(hexo d)时，robots.txt 就会被上传至网站了。 5. sitemap 的生成 Sitemap 可方便网站管理员通知搜索引擎他们网站上有哪些可供抓取的网页。最简单的 Sitemap 形式，就是 XML 文件，在其中列出网站中的网址以及关于每个网址的其他元数据（上次更新的时间、更改的频率以及相对于网站上其他网址的重要程度为何等），以便搜索引擎可以更加智能地抓取网站。 简言之， 网站地图（Sitemap）对于搜索引擎优化（Search Engine Optimization，SEO）非常重要，在网站中加入 Sitemap 有利于搜索引擎蜘蛛的抓取和收录。我们用安装以下两个插件来生成适用于谷歌和百度的 sitemap 12npm install hexo-generator-sitemap --savenpm install hexo-generator-baidu-sitemap --save 并在站点配置文件_config.yml中添加以下字代码 12345#hexo sitemapsitemap: path: sitemap.xmlbaidusitemap: path: baidusitemap.xml 之后每次在执行 hexo g 后，在public目录下都会生成了sitemap.xml和baidusitemap.xml两个文件。 Tips: 插件生成的 sitemap 的文章链接，都是以站点配置文件中的 url 为基础的，如果将博客绑定了域名，那最好将 url 字段填写为绑定的域名。 6. 验证网站在我们向搜索引擎提交 sitemap 之前，搜索引擎需要先验证我们对网站的所有权。 谷歌和百度两个搜索引擎提交的入口分别为： Google Search Console 百度站长平台 验证的方法很多，我两个搜索引擎均采用 1文件验证 的方法。Google 添加链接后，会自动跳转至验证页面，供我们下载 HTML 验证文件。 验证的方法很多，我两个搜索引擎均采用文件验证的方法。Google 添加链接后，会自动跳转至验证页面，供我们下载 HTML 验证文件。 谷歌验证示例 将下载的验证文件在 source 目录下。 为了使hexo不处理这两个验证文件，并且不生成关于这两个文件的 sitemap，我们需要打开验证文件，在最上面添加以下代码 123layout: falsesitemap: false--- 执行 hexo 部署命令 123hexo cleanhexo ghexo d 之后，就可以查看验证是否通过了。一般谷歌会很快给出验证结果，百度估计得等一天再去看。验证成功后的结果大致如下： 谷歌认证 百度认证 6. sitemap 的提交6.1 向谷歌提交向谷歌提交 sitemap 比较简单，登录 Google Search Console ，选择已经验证过的站点，在站点地图中添加 sitemap.xml的链接即可，谷歌效率较高，一般当天或者第二天就能搜到了。 我的不知道是什么原因，我使用sitemap.xml文件名提交显示无法读取，但是我把文件名换成sitemap-1.xml文件名后却可以成功？！不知为什么。 成功后的图如下： 到这一步，你可以等着谷歌对你的网页进行收录了。 6.2 向百度提交6.2.1 主动推送为使用主动推送，需要安装插件 , 参考官方说明 Hexo 插件之百度主动提交链接 首先，在你博客的根目录下，安装本插件： 1npm install hexo-baidu-url-submit --save 然后，同样在你博客的根目录下，把以下内容添加到 _config.yml 文件中: 12345baidu_url_submit: count: 3 ## 比如 3，代表提交最新的三个链接 host: https://wenkaiyan-kevin.github.io/ ## 在百度站长平台中注册的域名 token: your_token ## 请注意这是您的秘钥， 请不要发布在公众仓库里 ! path: baidu_urls.txt ## 文本文档的地址， 会自动生成，新链接会保存在此文本文档里 其次，记得查看 _config.ym 文件中 url 的值， 必须包含是百度站长平台注册的域名，比如我的就是我博客的地址https://wenkaiyan-kevin.github.io/ _config.ym 文件中 url 的值的位置 123# URLurl: https://wenkaiyan-kevin.github.io/root: / 如果想查看你的秘钥，按照如下方式查看即可： 最后，加入新的 deployer: 12deploy:- type: baidu_url_submitter 执行 hexo deploy 的时候，新的连接就会被推送了。主动推送是否成功会在执行 hexo deploy 时显示, success后的数字为主动推送成功的链接数 6.2.2 sitemap提交与上一个方法相比较，这个方法更为简单，按照如下所示提交即可，不过需要等上个一两天时间才能看到结果，最初的状态是等待。填写的内容，例如我的是：https://wenkaiyan-kevin.github.io/baidusitemap.xml 过几天成功后如下图所示：","link":"/posts/bd441b5.html"},{"title":"个人博客的搭建教程-基于Hexo+Github","text":"一、框架简介（基于Windows系统）Hexo是高效的静态站点生成框架，它基于Node.js，能在短时间内生成静态页面，只需要通过一条指令就可以部署到GitHub或其他托管平台。Hexo的文章支持MarkDown的所有语法功能，极大简化编辑和排版过程，能够让你将精力更多的放在文章内容上。而且，Hexo支持多种多样的实用插件完善自己的站点，如评论系统、访问统计、文章加密、站内搜索、音乐插件等。 当然本教程只是初级介绍，关于该方面的知识，我也会在以后的学习工作中进行新的尝试或改进。 二、前期准备前期主要是安装Hexo、Git、Node.js、Hexo等软件以及创建GitHub仓库。 2.1 创建GitHub仓库创建仓库名字必须为用户名.github.io。如果不用此名会导致页面出现问题，尽管这个问题可以使用其他方法进行解决，但为了尽可能的简单易行，我还是建议使用如上建议的方法 注册GitHub账号 首先是注册GitHub账号，这方面内容就不过多解释了，需要注意的是一点要使用短小精悍，并且容易让别人记住的用户名，因为后面你博客网址的地址会由你的用户名组成。 创建托管博客的仓库 点击右上角的New repository ——&gt; 在新的页面中填写Repository名字：用户名.github.io，其他都是默认选项，然后点击Create repository按钮，进行提交 ——&gt;创建完成 我这里显示红色是因为我先前已经创建过了，正常情况下是绿色。 2.2. 安装GitGit是一个开源的分布式版本的控制系统，用于敏捷高效的处理各种项目。我们以此为提交工具推送构建好的页面到GitHub上去。Git的下载页面，点击这里。整个安装流程，和其他win10下的软件安装流程一样，只需要一路next即可。 当在你的windows的命令行(win+R，然后输入cmd，回车)中输入git --version ，然后出现软件版本号的时候，说明此时你已经安装成功。 2.3. 获取SSH Key该步骤相当于常见的“记住密码”选项，如跳过此步骤，每次进行推送时都要输入自己的GitHub账号和密码，会比较麻烦。 首先在本地电脑配置Git，在windows的命令行(win+R，然后输入cmd，回车)中输入以下三条命令，如下图所示： 12345# 这里需要替换成你自己的用户名和邮箱地址git config --global user.name wenkaiyan-kevingit config --global user.email 610498675@qq.com# 输入下面命令后，会让你确认三次信息，这里都选择默认即可，也就是连续按三次回车即可ssh-keygen -t rsa -C 610498675@qq.com 如果前三步都正常的话，那么会在你的C:\\Users\\wkyan\\.ssh （当然，实际情况中你需要把我的用户名wkyan替换成你的真实路径）路径下生成两个文件，分别是id_rsa和id_rsa.pub 两个文件，其中在id_rsa.pub 文件中有你的公钥，用记事本打开，然后把里面的内容全部复制。 通过以下三步，把之前复制的公钥复制进来，然后提交，完成所有任务 如果一切顺利的话，可以在命令行输入：ssh git@github.com进行测试，输出信息会显示成功字样。 2.4. 安装Node.js与HexoNode.js是底层依赖，Hexo是上层应用，这里只需要用到Node.js附带的npm包管理器，并不需要大家去学习Node.js的语法。 2.4.1 安装Node.js Node.js的下载地址请点击这里。点击安装包一路默认安装即可，可能你需要提前在你的电脑上安装python，最后在windows的命令行(win+R，然后输入cmd，回车)中输入npm -v ，然后出现软件版本号的时候，说明此时你已经安装成功。 2.4.2 安装Hexo Hexo的安装需要在windows的命令行(win+R，然后输入cmd，回车)中使用Node.js的npm包管理器进行安装。命令入下（期间会出现WARN黄色信息，这是正常现象，无需关心）： 123# hexo-cli:安装的包# -g:设置为全局变量npm install hexo-cli -g 三、搭建与发布3.1 博客初始化在本地磁盘中（不要建在桌面或者C盘）创建一个文件夹，可以命名为0_MyBlog 。接下来打开你的windows的命令行，切换至你的博客文件夹路径下，然后输入： 1hexo init 期间会出现WARN黄色信息，这是正常现象，无需关心。最后会显示Start blogging with Hexo! 3.2 本地预览同样在windows的命令行，你的博客文件夹路径下，输入以下命令： 12345# 生成静态文件hexo g# 启动本地预览服务hexo s 在本地浏览器中输入http://localhost:4000，查看当前博客状态 3.3 配置站点输入下面的命令进行推送本地文件到github仓库的配置，如果你想重新安装博客，那么这条命令需要重新安装。 12# 一定不要忘记安装在当前目录下使用命令npm install hexo-deployer-git --save 然后，就是修改当前博客下面的_config.yml文件中的配置信息 12345#####修改配置文件deploy: type: 'git' repo: 'https://github.com/wenkaiyan-kevin/wenkaiyan-kevin.github.io.git' branch: master 关于repo地址的获取，你需要登录你的github，然后进入你为博客网站新建的仓库中，按照图中所示即可获取。 3.4 推送站点最后执行完以下三条命令后，即可完成博客的构建，如果出现time out的信息，那说明你的网络速度有问题，你需要多尝试几次就好了。 123456# 清除缓存hexo clean# 生成静态网页hexo g# 把所有文档推送到github(如果是第一次，可能会输入账号密码)hexo d 然后，打开浏览器，输入https://wenkaiyan-kevin.github.io/ ，就可以让其他人访问你的网站了。 四、站点维护4.1 更换主题hexo的主题有很多，具体有哪些主题可以访问这里。以我的主题为例，如果想更换博客主题，那么只需要以下几条命令，当然执行的当前路径必须是你的博客所在路径下。 12345678# 下载安装主题npm install -S hexo-theme-icarus# 切换成安装的主题hexo config theme icarus# 重新发布hexo clean &amp;&amp; hexo g --d 4.2 发布新的博客使用MarkDown书写你的博客文档，然后复制到你本地博客文件夹的source/_posts/下面即可，然后重新发布站点 12# 重新发布hexo clean &amp;&amp; hexo g --d 4.3 图床如果是你需要图床的话，可以尝试img.chr 。 五、其他如果觉得这篇博文对你有帮助，请记得打赏，更多新鲜趣闻记得关注我的B站账号。","link":"/posts/5f29c3b4.html"},{"title":"单细胞文章解析（1）：单细胞转录组图谱和染色质可及性揭示了水稻根的分化轨迹","text":"文章：Single-cell transcriptome atlas and chromatin accessibility landscape reveal differentiation trajectories in the rice root一、文章概述根的发育依赖于分生组织的建立，分生组织产生不同的细胞类型，这些细胞类型在确定的时间和空间梯度上分化。对双子叶和单子叶根尖分生组织的发育轨迹和转录网络进行剖析，有助于理解双子叶和单子叶根尖分生组织的功能。在这里，我们提出了水稻胚根的单细胞RNA (scRNA)测序和染色质可及性调查。通过单个根尖细胞的时间分布，我们重建了表皮细胞和基底组织的连续发育轨迹，并阐明了这些细胞谱系中决定细胞命运的调控网络。我们进一步鉴定了这些细胞类型的特征过程、转录组谱和标记基因，揭示了双子叶和单子叶之间保守和分化的根发育途径。最后，我们利用时空模型从细胞特异性基因队列中鉴定了水稻根分生组织突变体，证明了该平台在功能遗传学研究方面的潜力。 二、研究思路 三、结果解读3.1 水稻根尖细胞图谱绘制将野生型(ZH11)水稻幼苗的根(距根尖约1.0 cm, n= 90)采摘，消化成原生质体(无细胞壁的植物细胞)，在商用10× Chromium平台上进行水稻根scRNA -seq测序，并且进行了两次生物学重复。最终，获得了一个包含27,469个过滤细胞与29,919个基因的基因表达矩阵。依据表达特征，所有细胞被划分为21个细胞类群。 原生质体和线粒体基因对聚类的影响不大，以及去除批次效应后的结果 由于大多数细胞类型缺乏特定的标记，文中使用以下两种策略来注释水稻胚根细胞图谱中的细胞群体。首先，使用已经得到充分研究的水稻基因鉴定细胞群体类型。在UMAP上检测它们的表达模式有助于分配一些细胞簇。其次，作者对每个群体中特异性基因（超过30个基因）进行了RNA原位杂交分析。这些基因的表达模式不仅证实了上述注释，而且能够注释未知的细胞群体。 3.2 表皮细胞(Epidermal cells)的发育轨迹 将epidermis/root hair population(clusters 1, 4, and 9)进行重新聚类，最终得到10个类群，从E0到E9。 从cluster 9开始，分叉形成两条轨迹，分别由cluster1和cluster4两个类群的细胞组成。作者使用Palantir进行拟时序分析，其结果与UMAP的聚类结果相似，推断的轨迹显示出从cluster 9逐渐过渡到早期、中期和晚期根毛细胞或到非根毛细胞。 文中选择Os10g0452700、Os03g0155500、Os01g0248900和Os10g0578200作为cluster9、1和4的marker基因。其中，Os10g0452700的表达随着拟时间的延长而逐渐降低，接着是Os03g0155500的转录增加。Os01g0248900的表达在非根毛细胞发育后期升高，而Os10g0578200的表达仅在根毛细胞中逐渐升高。 荧光(Venus-N7)报告分析同样证实了由scRNA-seq数据集推断的表达模式。 总的来说，作者通过整合scRNA-seq数据、拟时序分析和报告基因分析等结果重建了水稻胚根根毛细胞和非根毛细胞发育过程中表皮细胞分化的过程。 3.3 基本组织细胞(Ground tissues)的发育轨迹 基本组织(fundamental tissue 或 ground tissue) 为1875年，J. Sachs 所提出植物体内的三种组织之一，另二者为表皮组织及维管束组织。 根据功能注释，聚类3、6和0分别被命名为外皮层、厚壁组织细胞层和皮层。作者通过仔细研究3D UMAP和t-SNE图上这三个类群的分布距离，发现这些细胞都与clsuter 11相连，因此，将cluster 11注释为分生组织细胞。因此，这一观察表明表明，cluster 11可能是基本组织共同的未分化祖细胞。 通过分析作者发现，在cluster 11中有多个转录因子高表达，例如OsGATA6和OsERF108的表达随着假时间逐渐减少。RNA原位杂交实验证实，OsGATA6和OsGRF6转录本主要聚集在RAM中心QC上方，并沿细胞分裂方向逐渐减少，直至达到分化区域。由此可见，cluster 11是由分生组织细胞组成，在水稻根尖形成了不同类型的基本组织和维管组织。 为了更好地了解基本组织分化背后的基因调控机制，作者将cluster 0,3,6,11重新聚类进行拟时序分析。结果显示出从分生组织细胞分化形成了外皮层、厚壁组织细胞层和皮层的过程。 以上分析表明OsGATA6在RAM中QC上方的中心位置表达，沿着细胞分裂方向其表达量逐渐降低，因此，OsGATA6可能在基本组织和维管组织的分化中起重要作用。为了验证这一假设，作者使用CRISPR-Cas9技术生成OsGATA6敲除突变体。纯合子Osgata6突变体植株具有矮化和短根的表型。而且，突变体的RAM较短，细胞分裂和分化出现缺陷。 3.4 通过ATAC-seq和scRNA-seq的整合分析推断细胞分化的转录调控机制 作者从根尖分生组织区(MZ)和伸长区(EZ)获取材料。对比MZ和EZ样品，发现染色质可及性发生了巨大变化。由此可知，在根尖分生组织细胞在分化过程中，染色质可及性放生了相应的变化。 作者使用HOMER软件鉴定了与染色质可及性变化相关的转录因子结合Motif。MZ和EZ样品富集了不同的转录因子结合Motif。转录因子家族如bHLH、bZIP和GATA的结合Motif在MZ中高度富集，而MYB转录因子结合Motif在EZ中富集。与这些结果一致的是，OsGATA6 (GATA转录因子)和OsBUL1(bHLH转录因子)，这两个基因在cluster 11(对应于外皮层、厚壁组织细胞层和皮层细胞的分生组织细胞)中高表达，仅在MZ表现出开放的染色质状态。相比之下，MYB转录因子基因(cluster 12)MYB12和MYB52的调控区域在MZ区域是封闭的，而在EZ区域则是开放的。 为了检验在水稻根系发育过程中，给定基因的染色质可及性与其表达水平是否相关，作者对scRNA-seq和ATAC-seq数据集进行了综合分析。首先，将差异可及的基因分配到scRNA-seq实验揭示的细胞簇中。在MZ中，属于分生组织细胞的细胞群体(例如，cluster 9和cluster 11)显示了较高可及性的基因比例。相反，分配给分化组织的细胞群体(如cluster 2、7、8和12)显示出在EZ中拥有更高的染色质开放程度。 cluster 9 (分生组织细胞)中的基因(Os10g0452700和OsEXPA11)在MZ中比在EZ中表现出更高的染色质开放程度。相比之下，在cluster 1和cluster4(分化的表皮细胞)中富集的基因(Os08g0112300, Os10g0490900, Os07g0176600和OsPKS16)在MZ中基本没有信号，但在EZ中却呈现出相反的信号趋势。 因此，上述结果表明，分析不同发育区域的染色质可及性可以揭示细胞分化的转录调控机制。 3.5 种间比较揭示了根系发育过程中的保守性和差异性 作者首先整合了3个已发表的拟南芥根scRNA-seq数据集，并重新进行了细胞聚类和分配，共鉴定出22个细胞簇。 通过对拟南芥和水稻根细胞簇的两两比较，发现分生组织、表皮细胞(无毛细胞和根毛细胞)、韧皮部和木质部细胞对应的细胞簇具有较高的相似性。有趣的是，水稻内胚层簇与拟南芥中相应簇的相关性较低，但与拟南芥中不含韧皮部和木质部细胞的维管组织(VC-P-X)呈正相关，表明这些细胞类型在功能上是一致的。水稻外皮层和拟南芥内皮层之间的相关性表明，它们是同源组织，与它们作为细胞运输屏障的功能一致。 由于拟南芥和水稻在根毛、韧皮部和木质部上具有最高的一对一相似性，作者对它们进行了更详细的描述。对于根毛细胞类群，基因聚类分析显示了在两个物种的根毛中高表达的核心(保守)基因列表。值得注意的是，已知这些基因中的一些在根毛发育中发挥重要的调控作用。例如，PRPL1 (PROLINE-RICH PROTEIN-LIKE 1)和EXPA7 (EXPANSIN A7)，它们都主要在根毛类群中表达。在拟南芥和水稻中有抑制根毛伸长的报道。同样，参与根毛发育的基因如RSH4、CML25 和RHD4也在两个物种共有的基因列表中。基因聚类分析同样观察到物种的特异性，表明每个物种的根毛具有独特的特性。与根毛类群的观察结果类似，作者还成功地鉴定出了与韧皮部和木质部细胞相对应的核心基因列表。 四、总结 作者通过聚类分群，在水稻胚根中公鉴定出21个细胞类群，分别由表皮、外皮层、厚壁细胞、皮层细胞、内皮层细胞、中柱鞘细胞、分生组织细胞、维管组织（韧皮部，木质部）、根冠细胞组成。 其次，通过对Cluster 1,4,9类群的进一步分析，探究了表皮细胞分化成根毛细胞与非根毛细胞的过程。 作者进一步通过对Cluster 0,3,6,11重新聚类分析。显示出从分生组织细胞分化形成了外皮层、厚壁组织细胞层和皮层的过程。 为了揭示细胞分化的转录调控机制，作者分析不同发育区域的染色质可及性 最后，作者探究了胚根细胞类型在单子叶-双子叶植物中的分裂与分化过程中的保守性。","link":"/posts/aada8f5.html"},{"title":"节日快乐","text":"背景通过翻阅各种个人博客网站搭建的资料，经过三天的学习，终于把个人的网站给搭建好了。正好今天是七夕情人节，所以在这个值得纪念的日子里发布一下本人的第一篇博客。 博主介绍 学校：南京农业大学 学院：农学院&amp;前沿交叉学院&amp;生物信息中心 年级：博士四年级 专业：生物信息学 研究方向：表观遗传学&amp;深度学习&amp;机器学习 关于个人更为详细的介绍，请期待个人的简历页面！ 目的与动机之前很长一段时间想要整理自己的以往的学习笔记和工作笔记，并且想通过互联网以博客的形式分享给他人，但是始终没有做出实际行动来。由于本人现在属于延期状态在校外住宿，加上这几天的大雨和疫情，所以我就没有去实验室工作。为了打发时间躺在床上刷起B站，偶然间翻看到搭建个人博客网页的视频，于是之前的想法又涌上心头。为了付诸实践，我果断起床打开笔记本电脑，然后按照接触到的视频查阅、整理这方面的资料。由于资金有限，最终选择了使用GitHub+Hexo的方法来搭建自己的博客网站。经过不断的尝试和调试，最终完成了之前有想法没实践的任务。 分享主题与内容我搭建个人博客所分享的主题是关于生物信息学中与我当前科研方向相关的一些生信分析实践内容和分析技巧。通过这样的形式，我可以复习一下从硕士到博士期间所学习的知识，以及整理这近七年时间的工作，然后以博客的形式分享给他人，并提供一些自己的想法与见解给读者。 鸣谢感谢第一个打赏我的人——梁旭苹同志！！！让我收到了人生中第一份打赏。","link":"/posts/1e9fcb27.html"},{"title":"植物愈伤组织综述","text":"文章：Plant Callus: Mechanisms of Induction and Repression一、研究背景植物对各种生物和非生物刺激会产生像愈伤组织和肿瘤这样的无组织细胞团。自生长素和细胞分裂素这两种促生长激素联合诱导植物离体愈伤组织以来，该实验系统已广泛应用于基础研究和园艺应用。愈伤组织形成的分子基础一直不清楚，但我们终于开始了解正常植物发育过程中细胞的非计划增殖是如何被抑制的，以及遗传和环境因素是如何压倒这些抑制而诱导愈伤组织形成的。在这篇综述中，将首先概述愈伤组织在自然界和离体培养中的发育，然后描述目前对愈伤组织形成的遗传和表观遗传机制的认识。 二、研究思路在这篇综述中，将首先概述在体外和自然中愈伤组织和肿瘤的形成，以突出其生理特性的相似性和多样性。然后，总结目前的知识，如植物如何重新规划分配其组织和细胞点的分化地位和恢复增殖能力，以产生愈伤组织。最后，我们将描述在植物胚后期发育过程中抑制愈伤组织诱导的遗传和表观遗传机制。 三、结果解读3.1 愈伤组织在体外和自然中的形成 Schematic Illustration of Various Types of Plant Callus 3.1.1 离体培养条件下愈伤组织的形成外源应用生长素和细胞分裂素诱导各种植物产生愈伤组织。一般来说，中等比例的生长素和细胞分裂素促进愈伤组织的诱导，而较高比例的生长素和细胞分裂素或细胞分裂素和生长素分别诱导根和芽的再生。其他激素，如油菜素内酯或脱落酸，也能诱导愈伤组织，在某些物种中，可以替代生长素或细胞分裂素形成愈伤组织。 在拟南芥中，将茎或根外植体置于含生长素和细胞分裂素的愈伤组织诱导培养基(CIM)上，在靠近木质部极的中柱鞘细胞可以形成愈伤组织。通过形态学观察，这些愈伤组织并不是一团没有组织的细胞;相反，它们有类似侧根原基的组织结构。随后通过转录组分析证实，这些愈伤组织具有与根分生组织有着高度相似的基因表达谱。与这些发现相一致的是，无论其来源如何，在侧根原基发育缺陷的突变体中愈伤组织的形成都受到强烈的抑制。这些数据表明，CIM通过介导侧根起始的遗传途径诱导愈伤组织，至少在拟南芥中，CIM诱导的愈伤组织不像之前认为的那样是通过去分化生成的。 3.1.2 创伤诱导愈伤组织的形成从树木的蜕皮到园艺繁殖，创伤诱导的愈伤组织形成一直被观察和应用于各种环境中。这些愈伤组织经常积聚植物抗毒素和病原体相关蛋白，因此被认为可以防止感染和水分流失。创伤诱导的愈伤组织来源于多种细胞类型，包括血管细胞、皮层细胞和髓细胞。在某些情况下，伤口诱导的愈伤组织再生新的器官或新的组织，表明它们是高度多能性的。伤口促进拟南芥幼苗不同部位愈伤组织的形成。愈伤组织的外观与CIM诱导的愈伤组织不同。此外，与CIM诱导的愈伤组织不同，在侧根起始缺陷的单根突变体中，创伤诱导的愈伤组织不显示根分生组织标记的表达，其形成也没有受到阻碍。这些观察结果表明，这两种类型的愈伤组织在分子和生理特性上是不同的。稍后我们将详细讨论，至少在某些方面可以证明，创伤形成的愈伤组织是通过上调细胞分裂素信号驱动的。 3.1.3 病原体诱导肿瘤根茎瘿为植物肿瘤之一种。在多数双子叶植物和裸子植物以及少数单子叶植物中，由于土壤细菌根癌土壤杆菌的感染而发生。这些细菌通过伤口进入植物，促进无组织细胞团的肿瘤生长。编码生长素和细胞分裂素生物合成酶的细菌基因的表达迫使感染植物产生根茎瘿病。 tsm1和tsm2基因，这些基因都位于细菌肿瘤诱导质粒的T-DNA区域，在感染时随机插入宿主植物基因组。即使去除细菌，也可以在不使用外源植物激素的情况下进行冠瘿细胞的继代培养。此外，来自冠瘿的单个细胞可以再生整个植物，表明冠瘿细胞是全能的。 在自然界中，病毒感染是植物癌变的另一个来源。 创面肿瘤病毒（WTV）又称三叶草大静脉病毒，属于III类病毒家族。WTVs诱导的肿瘤组织结构相对较好，包括异常木质部、分生肿瘤细胞和假韧皮部，假韧皮部被寄主植物的皮层和表皮细胞包围。 稻瘿矮病毒也属于III类病毒科，可诱导禾科植物(如水稻、小麦和大麦)的瘿形成。 3.1.4 种间杂交诱导的遗传肿瘤遗传肿瘤是指由于种间杂交导致的细胞无组织过度增殖，在芸苔属、曼陀罗、百合和烟草中特别常见。从杂交植物中切除的肿瘤细胞可以在无植物激素的培养基中传代，并表现出全能性。衰老和损伤进一步增强杂交植物的肿瘤。遗传肿瘤的分子机制尚不清楚，但内源性生长素和细胞分裂素的水平似乎在肿瘤杂交植物中发生了改变。一些遗传肿瘤伴随着胚胎发生或分生组织发育中关键调控因子的错误表达。因此，肿瘤可能是由于重新获得未分化状态或组织分化失败造成的。 3.2 愈伤组织形成的分子基础在过去的十年中，已经发现了许多在愈伤组织形成过程中受损的突变体，对这些突变体的分子遗传学分析表明，愈伤组织的诱导受复杂的调控机制的控制。细胞增殖能力的重新获得是愈伤组织诱导的一个中心特征。单个核心细胞周期调节因子，如细胞周期蛋白(CYCs)或细胞周期蛋白依赖激酶(CDKs)的激活通常不足以诱导愈伤组织。因此，迄今为止描述的大多数愈伤组织诱导过程采用转录或转录后调节因子，引起基因的表达或蛋白质翻译的整体变化。在下一节中，我们将描述植物如何解读各种生理和环境信号来触发细胞重新进入细胞周期。 Molecular Mechanisms of Callus Induction 3.2.1 植物激素诱导愈伤组织形成的研究生长素和细胞分裂素被广泛应用于愈伤组织的产生，但令人惊讶的是，它们在分子水平上如何诱导愈伤组织却知之甚少。最近的一些研究表明，侧根发育的各种调节因子参与了CIM上愈伤组织的形成。 LBD16、LBD17、LBD18和LBD29在内的4个LDB转录因子介导了生长素反应因子 ARF7和ARF19的下游反应，E2Fa功能缺失突变强烈阻碍侧根发育。因此，ARF-LBD-E2Fa通路定义了植物生长素信号转导到细胞周期控制的一种机制。 研究表明，LBD16、LBD17、LBD18和LBD29的表达被CIM上调，并且这四种基因的任何一个过表达都足以诱导出与CIM诱导的愈伤组织外观相似的愈伤组织。 除了激活与细胞周期相关的转录因子活性，下调抑制细胞周期的相关调节因子是在愈伤组织形成过程中重新获得细胞增殖能力的另一种策略。 生长素下调编码CDK抑制剂的kip相关蛋白(KRP)基因，转录适配器蛋白PROPORZ1 (PRZ1，也被称为At-ADA2b)已被鉴定为这一过程中的关键调节蛋白。prz1在激素条件下形成愈伤组织，而野生型根形成侧根，这种过度增殖伴随着低水平的KRP2、KRP3和KRP7转录。PRZ1直接结合KRP2、KRP3和KRP7的启动子区域，促进KRP7处组蛋白H3-K9/K14的乙酰化。乙酰化水平随着生长素处理而降低，进而降低基因表达。 细胞分裂素如何促进愈伤组织形成尚不清楚，但参与愈伤组织诱导的一个关键成分是B型拟南芥反应调节因子(ARRs)。B型ARRs转录因子通过多步磷酸传递激活，诱导多个靶基因的表达。在缺乏外源植物激素的情况下，过表达缺乏磷酸化结构域的ARR1或ARR21的结构性活性形式会导致愈伤组织的形成。B型ARRs促进细胞周期再进入的一个潜在靶点是CYCD3，因为CYCD3在细胞分裂素处理后1小时内表达上调，并且在缺乏外源细胞分裂素的情况下，CYCD3过表达增强了愈伤组织的形成。 AP2/ERF转录因子促进芽再生、ESR1和ESR2是其他可能在细胞分裂素介导的愈伤组织形成中发挥作用的候选基因，因为过度表达ESR1或ESR2可以在没有外源植物激素的情况下诱导愈伤组织。类似的愈伤组织诱导存在于激活标记系BOLITA (BOL)中，与ESR2的位点相同。ESR蛋白参与了细胞分裂素信号通路，因为ESR过表达的植物对细胞分裂素的反应升高，它们挽救了细胞分裂素受体突变体的再生缺陷。ESR蛋白可能将细胞分裂素信号与细胞周期控制联系在一起，因为ESR2直接激活CYCD1;1和DOF转录因子OBF BINDING PROTEIN1 (OBP1)的表达。OBP1基因通过缩短G1期的持续时间来促进细胞周期的再进入。OBP1过表达导致许多细胞周期相关基因上调，并且OBP1直接结合CYCD3;3的启动子序列和S相特异性转录因子DOF2;3。未来还需要进一步的实验来验证这些esr介导的通路是否在愈伤组织诱导过程中激活细胞周期，但这些发现支持细胞周期再进入受多层转录调控调控的观点，以协调多个细胞周期基因的表达。 3.2.2 外伤诱导愈伤组织形成的研究 机械损伤长期以来被认为是诱导愈伤组织的一种常见刺激，但其分子机制尚不清楚。一种AP2/ERF转录因子，WOUND INDUCED DEDIFFERENTIATION1 (WIND1)及其近同源物WIND2, WIND3和WIND4是该反应的中心调控因子，最近在拟南芥中被发现。WIND蛋白通过细胞分裂素介导的途径发挥作用。 创伤也可诱导组织或器官再生，其潜在的分子机制在拟南芥中开始被理解。虽然这些过程不涉及广泛的过度增殖，但它们似乎涉及体细胞的去分化。例如，根尖切除可使失去的根尖迅速再生。指示细胞命运重建的第一个转录变化可在损伤后数小时内检测到，功能根尖在24小时内恢复(Sena等，2009)。其余的分生组织细胞参与再生，表明干细胞生态位外的分生组织细胞仍然具有损伤后去分化的能力。值得注意的是，这些再生过程并不需要干细胞生态位的活性，因为在干细胞维持方面有缺陷的拟南芥突变体在形成新的根尖时不会受到损害(Sena et al.， 2009)。、 3.2.3 通过重新获得胚胎或分生组织命运诱导愈伤组织近年来的大量研究表明，胚胎调节剂或分生组织调节剂的异位过表达诱导各种植物的愈伤组织形成(图4D)。这些发现表明，相对未分化细胞的过度激活足以驱动无组织细胞增殖。CCAAT-box结合转录因子LEC1 (leaf COTYLEDON1, LEC1)、B3结构域转录因子LEC2和MADS box转录因子AGL15 (AGL15)在胚胎发生过程中作为转录激活因子发挥作用。当这些转录因子中的任何一个在拟南芥中异位表达时，产生的植物在无植物激素的培养基上产生胚性愈伤组织。 WUSCHEL (WUS)在茎分生组织的干细胞组织中心表达，它是维持干细胞处于相对未分化状态所必需的。WUS也在多个愈伤组织株系中强烈表达，过表达WUS的拟南芥植株可产生愈伤组织和体细胞胚。 3.2.4 愈伤组织形成过程中的RNA加工和蛋白质翻译愈伤组织的诱导过程涉及基因表达的巨大变化，从而改变细胞分化和脱分化的水平。到目前为止，我们已经描述了负责这些转录修饰的各种调节剂，但一些证据表明，准确的RNA生产和/或处理的失败限制了愈伤组织的产生。芽再分化缺陷2 (SHOOT REDIFFERENTIATION defect 2, SRD2)基因编码一种与人类SNAP50序列相似的核蛋白，SNAP50是小核RNA (snRNA)转录所需的蛋白质。srd2突变体在限制性温度下无法转录snRNA，而且，令人瞩目的是，这些缺陷会干扰cimc诱导下胚轴外植体愈伤组织的形成。snRNA被认为作为剪接体的一个组成部分在RNA剪接中起作用.因此，srd2介导的snRNA的产生似乎是在cam诱导的愈伤组织形成过程中pre-mRNA剪接的关键。Koukalova等人(2005)在烟草叶片外植体中检测到激素诱导愈伤组织形成过程中rRNA转录水平的升高。类似地，Ohbayashi等人(2011)报道了在cima诱导的拟南芥下胚轴愈伤组织形成过程中rRNA前体的积累，推断出在愈伤组织诱导过程中活跃的rRNA生物发生。与此一致的是，核定位甲基转移酶样蛋白ROOT INITIATION DEFECTIVE2 (RID2)的突变在限制性温度下阻碍了cam诱导的愈伤组织形成，这些表型伴随着各种pre-rRNA中间产物的异常积累(Konishi和Sugiyama, 2003;Ohbayashi等人，2011)。 SRD2和RID2都在分生组织中表达，在CIM上孵育后诱导其转录，表明它们的活性与细胞的高增殖能力紧密相关。这些转录后过程可能不是愈伤组织诱导的初始触发，它们更有可能产生愈伤组织形成所需的新蛋白质组。先前的蛋白质组学分析确实揭示了愈伤组织诱导过程中拟南芥子叶核蛋白谱的动态变化。 3.3 愈伤组织抑制的分子基础 Molecular Mechanisms of Callus Repression 保持正确的身体结构和组织结构是植物充分生长和功能的前提。因此，植物细胞必须能够防止计划外的过度增殖。在本节中，我们将讨论如何通过遗传和表观遗传机制抑制愈伤组织诱导。 3.3.1 细胞壁的完整性细胞壁结构物质如纤维素、半纤维素和果胶的有序沉积对建立或维持细胞分化状态至关重要。细胞壁产生的功能缺失突变常导致愈伤组织的形成。 Nicotiana plumbaginifolia中的GUT1突变体nolac-H18在茎尖形成愈伤组织。果胶的生物合成需要GUT1蛋白，因为它将葡萄糖醛酸转移到鼠李糖醛酸II，鼠李糖醛酸II是植物中最普遍的果胶形式之一。 拟南芥tsd1和tsd2功能缺失突变体发育出无组织结构的细胞团，该细胞团可以在无激素的培养基上无限生长。TSD1也可以叫做KOR1或者RSW2，该基因参与纤维素的生物合成。tsd1突变体在纤维素合成方面存在缺陷，该缺陷还伴随着果胶成分的显著变化，共同导致芽和根的细胞的乱序。并且在tsd1突变体中SHOOTMERISTEMLESS和CLAVATA3两个基因表达异常。此外，在tsd1/kor1/rsw2突变体中，细胞分裂素信号强烈增强，而编码细胞分裂素降解酶的细胞分裂素氧化酶(cytokinin OXIDASE1)过表达部分挽救了tsd1/kor1/rsw2突变体的过度增殖表型；TSD2也称作QUA2或者OSU1，该基因编码一种甲基转移酶。tsd2突变体中半乳糖醛酸的含量下降了50%，导致细胞粘附严重缺陷。这些细胞壁突变体的过度增殖表型可能是细胞间通讯中断的间接后果。 3.3.2 表观遗传调控表观遗传调控因子通过染色质修饰影响基因表达，包括DNA甲基化和组蛋白修饰。由这些表观遗传调节因子调控的染色质整体状态被认为在细胞分化和去分化的控制中发挥中心作用。 PRC1与PRC2是组蛋白修饰过程中两个保守的蛋白复合物。在动物中，PRC2产生转录沉默染色质的标记H3K27me3修饰后，通过招募PRC1来产生H2AK119ub标记，从而稳定这一沉默效果。然后在拟南芥中，首先是由H2AK119ub抑制基因表达，然后由H3K27me3来维持这样的抑制作用。大量的证据表明，植物的PRC蛋白是在分化器官中稳定抑制胚胎和分生组织程序所必需的。 PICKLE (PKL)蛋白，可能在抑制非计划的过度增殖中发挥核心作用，因为PKL突变体在萌发后不久就会形成愈伤组织。此外，PKL似乎参与了H3K27me3的沉积，因为PKL存在于幼苗的LEC1和LEC2位点，在PKL突变体中其H3K27me3水平降低，导致它们的抑制减弱，从而诱导愈伤组织。","link":"/posts/e214254.html"},{"title":"单细胞文章解析（2）：拟南芥茎尖单细胞分析","text":"A single-cell analysis of the Arabidopsis vegetative shoot apex一、文章概述在植物的整个生命周期中，茎顶端分生组织允许新的气生结构的反复形成。我们使用单细胞RNA测序在转录组水平上定义拟南芥茎尖的细胞分类。我们发现拟南芥茎尖由高度异质性的细胞组成，它们可以被划分为7个主要的群体，其中包含23个转录组水平上较为差异的细胞类群。作者描述了表皮细胞、维管组织和叶肉细胞的细胞周期连续性和发育轨迹，并推断出决定细胞命运的转录因子和基因的表达特征。最后，作者对茎尖和根尖细胞群体的综合分析进一步揭示了表皮和维管组织的相似性与差异性。该篇文章的研究结果为探究植物细胞分裂和分化的基本原理提供了一个有价值的资源。 二、研究背景除下胚轴和子叶外，植株地上部分均由茎尖分生组织(SAM)产生。被子植物的SAM由具有特定结构特征的小圆顶细胞组成。具研究SAM的不同层或区域调控着干细胞稳态和叶原基初始化。在克隆研究的基础上，拟南芥SAM可分为三个层。L1层的细胞可分化形成芽、叶和花的表皮，而L2层形成中胚层组织和生殖细胞，L3层形成维管组织和髓。根据植物形态学和组织学研究，拟南芥的SAM也可以分为不同的区域。中央区域(CZ)是干细胞聚集的地方。外周区(PZ)，这里的细胞分裂比CZ更频繁，负责器官的初始化，以及肋骨分生组织(RM)，它产生茎轴的中心组织。 植物干细胞的生态位是在胚胎发育过程中确定的。在动物中，干细胞聚集在干细胞生态位（SCN）中，SCN产生信号，调节干细胞的分裂和分化。在茎尖组织中，维持干细胞的数量需要在组织中心(OC)区域表达同源结构域蛋白WUSCHEL (WUS)以及在中央区域（CZ）表达CLV3。茎尖干细胞经过几轮分裂，最终分化并产生不同类型的器官，如叶和花。 尽管前人已经对经尖分生组织进行了大量的研究，但是对茎尖上每个细胞的特性仍缺乏全面的了解，因此，这限制了我们探究分生组织功能和描述分生组织细胞分化轨迹。此前的分析研究使用报告基因纯化细胞群，这是一种低估细胞复杂性的方法。与bulk RNA测序相比，单细胞RNA测序(scRNA-seq)实现了更高的分辨率，能够表征植物中不同细胞群的亚群的许多特性。例如，几个scRNA-seq研究表明，拟南芥根尖细胞在转录组中是高度异质性的。不同发育阶段个体细胞的空间分布和时间顺序揭示了根系发育的连续分化轨迹。 三、结果解读3.1 拟南芥茎尖细胞图谱的绘制3.1.1 材料获取与聚类分群 由于拟南芥茎尖非常的微小由SAM和叶原基组成，从茎尖分离出分生组织也就十分的困难。作者获取了500个茎尖，从而增加了样品中茎尖分生组织细胞（SAM）的数量。为了区分SAM与叶细胞类群，作者同样采摘了18天的幼叶。茎尖和叶片材料分别进行消化获得原生质体，然后通过10X Genomics平台进行单细胞测序。茎尖样品做了两次生物学重复。 在后续的分群聚类过程中，作者还消除了原生质体制备过程和细胞周期因素对分群的影响。最终，作者从茎尖和叶片的36643个细胞中鉴定出23个细胞类群，这些细胞类群最后被归为7个较为大的类群，分别是：叶肉细胞（mesophyll cell，MC）、茎尖分生组织细胞（shoot meristematic cell，SMC）、维管组织细胞（vascular cell，VC）、表皮细胞（epidermal cell，EC）、增殖细胞（proliferating cell，PC）、保卫细胞（guard cell，GC）和伴随细胞（companion cell，CC）。 作者研究的是SAM为什么还要加上叶片细胞？ 3.1.2 各类群的鉴定 叶肉细胞类群（Clusters 0, 3, 4, and 16） 光合作用基因CHLORORESPIRATORY REDUCTION23 (CRR23), *RUBISCO SMALL SUBUNIT 2B (RBCS2B)和PHOTOSYNTHETIC NDH SUBCOMPLEX L1 (PNSL1)*这三个基因主要在这几个类群中表达。通过检测富集到的marker基因AT1G13650的启动子活性，该类群的推断得到了进一步证实。 表皮细胞类群（Clusters 2, 12, 14, and 18） 在EC细胞类群中检测到表皮组织特异性表达的基因MERISTEM LAYER1 (ATML1), PROTODERMAL FACTOR1 (PDF1)和FIDDLEHEAD (FDH)。 茎尖分生组织细胞（Clusters 1, 13） 建立和维持拟南芥SAM所需的基因SHOOT MERISTEMLESS (STM)以及同源结构域基因KNAT1, KNAT2 , KNAT6在这两个类群中富集表达。 增殖细胞类群（Clusters 5, 9, 17, and 19） 与细胞周期相关的三个基因如*HISTONE H4 (HIS4)、CYCLIN-DEPENDENT KINASE B2;1 (CDKB2;1)和CY-CLIN A1;1 (CYCA1;1)*在这四个类群中富集表达。 维管组织细胞类群（Clusters 6, 7, 10, and 22） VC群体由4个细胞类群(6、7、10、22)组成，其中木质部和韧皮部分化相关基因富集表达。例如，韧皮部基因*SMAX1-LIKE5 (SMXL5)和木质部基因PHLOEM INTERCALATED WITH XYLEM (PXY)*的转录本分别在第7和第10细胞类群中显著富集。 保卫细胞类群（Clusters 11） *FAMA (FMA)、EPF1 (EPIDERMAL PATTERNING FACTOR1)*等GC的marker基因在Cluster 11细胞类群中特异性富集。 伴随细胞类群（Cluster 15） *PHLOEM PROTEIN2-A1 (PP2-A1) and SUCROSE-PROTON SYMPORTER2 (SUC2)*等CC的marker基因在Cluster 15细胞类群中特异性富集。 内皮层细胞类群（Cluster 20） Cluster 20富集了参与芽向地性反应的基因，表明存在一个独特的细胞群体，负责在芽中感知重力。对该类群中的两个marker基因(ACTIN DEPOLYMERIZING FACTOR9和AT4G11290)的启动子报告分析表明，Cluster 20细胞类群属于芽内皮层细胞类群。 未知的细胞类群（Cluster 8, 21） Cluster 8, 21由于缺乏已知的标记基因而无法得到注释。此外，RNA荧光原位杂交检测特异性基因同样没有产生可靠的信号。GO富集分析显示，该类群被标注为生物过程类别“应激反应”的基因占主导地位。 3.2 控制芽枝角度相关基因的鉴定在细胞类群的分群聚类注释的过程中，文章鉴定出每个类群中特异表达或者富集表达的基因，那么这些基因对植物茎的生理发育又有着哪些影响，作者希望能通过反向遗传学来试着挖掘出一些有价值的信息。本文作者重点观察了了Cluster 20这个群体，之前对该群体的marker gene进行功能富集分析发现，该类群中的基因主要富集于茎对重力响应的功能。之前研究发现，LAZY1, TILLER ANGLE CONTROL1 (TAC1), and SHOOT GRAVITROPISM6 (SGR6)这些基因都与茎的重力响应相关。在该类群中作者选择了48个marker基因，从种子库中心获得相应的纯合子的T-DNA插入突变体。最终，作者发现AT5G22580和AT1G25230这两个基因的突变体的表型与sgr6植株的表型一致都显示出大分枝的表型。 3.3 表皮细胞、叶肉细胞与维管细胞中的细胞周期特性植物发育的关键因素之一是在茎尖通过细胞分裂和分化形成器官。Transit-amplifying细胞是一群未分化的细胞，被认为是干细胞与已分化细胞的中间状态。为了了解表皮、叶肉和维管组织的发育轨迹，需要识别和表征相应的早期分裂细胞，分化中的细胞和已经分化的细胞。 3.3.1 表皮细胞类群 首先，对所有的表皮细胞重新进行聚类分群，最终得到13个亚群（E0~E13），E3，E7，E8，E9四个亚群形成一个闭环结构。 其次，（1）由于DNA合成基因HIS4 和 TSO2在E3中富集表达，因此E3被识别为S期细胞类群；（2）CDKB2;1 and CYCA1;1基因在E9中富集表达，因此E9被识别为G2期细胞类群；（3）M期细胞类群由E7组成，该亚群中富集表达*EARLY NODULIN-LIKE PROTEIN15 (ENOD15)和MITOTIC ARREST-DEFICIENT2 (MAD2)这两个M期标志性基因。（4）最后，由于MINICHROMSOME MAINTENANCE7 (MCM7)、PROLIFERATING CELL NUCLEAR ANTIGEN2 (PCNA2)、CYCLIN D3;2 (CYCD3;2)*和核糖体蛋白编码基因如核糖体蛋白L24e (RPL24)和核糖体蛋白S6 (RPS6)的高表达，将E8亚细胞群划分为G0或G1期。 3.3.2 叶肉细胞类群与维管细胞类群首先，依照前面的分析思路作者解析叶肉细胞与维管细胞群体中的细胞分裂活动。但是，在MC和VC群体中并没有观察到与EC群体相似的细胞周期分布。作者推断这两个群体中与细胞周期相关的群体可能分布在增殖细胞群体中。通过对PC细胞类群进行重新群类分群，Cluster5和Cluster9被分成了两个亚群（Clusters 5a and 5b; Clusters 9a and 9b）。 由于与光合作用相关的基因RBCS2B和PNSL1在Clusters 17, 5a, and 9a中富集分布，而维管组织的marker基因SMXL5和*GLUTAMINE DUMPER4 (GDU4)*主要在clusters 19, 5b, and 9b中富集分布。这说明PC群体主要由两个分裂细胞群体组成，从而导致了叶肉细胞和维管组织的分化。通过对这两个群体重新分群聚类，最终作者挖掘出与表皮细胞类群中相似的细胞周期现象。 最后，基于EC、reMC和reVC群体中在相同细胞周期阶段表达的基因，创建了一个拟南芥基因核心目录，并记录其转录水平在细胞周期中周期性变化。 3.4 表皮细胞向气孔分化的研究 高度分化的表皮细胞是在叶片发育过程中由表皮原始细胞分化而来的。气孔是由分生组织母细胞通过细胞分裂和一系列分化而产生的。为了探究气孔细胞的生成过程，作者将表皮细胞类群中的E3, E7, E8, and E9归为细胞分裂亚群，将E1, E8, and E11归为分化亚群。 一些与气孔发育相关的早期基因如POLAR, SPCH, BASL, TMM，在分裂亚群中富集表达，特别是参与分生体母细胞不对称分裂的基因如POLAR和BASL在S期高表达。而抑制气孔分化的基因TMM和EPF2的表达量主要在M期或G0/G1期达到峰值。因此，这些基因的时间表达模式可能将其产物的积累与细胞的不对称分裂或保卫细胞分化所需的特定时间窗口联系起来。 通过拟时间分析，对EC群体E1、E8和E11聚类细胞进行排序，揭示了气孔的后期分化轨迹。与之前的报道一致，调控这些细胞命运转变的关键转录因子，包括MUTE、FMA和MYB60，沿着细胞分化轨迹依次表达。 3.5 维管组织的分化轨迹 维管分生组织中的干细胞，也称为原形成层或形成层，通过不对称的周壁细胞分裂，连续产生两个传导组织，木质部和韧皮部。同样，作者把4.3中的重新聚类的维管组织细胞（reVC）分为分裂亚群（V2, V3, V6, and V8）和分化亚群（V3, V7, V9, and V12）。通过RNA原位杂交实验的验证，韧皮部由V0, V5, and V12细胞类群组成，V1, V4, V7, and V9-11组成了木质部。V12被鉴定为韧皮部的筛管细胞类群，V9鉴定为木质部的导管细胞类群，因为SEOR1，SEOR2，XCP1，XCP2基因在这些类群中富集分布。 在拟时序分析中，作者同样鉴定出了TEs (xylem)和SEs (phloem)两条分化轨迹。与植物激素生长素促进木质部分化的作用相一致，在木质部分化轨迹上与生长素通路相关的基因，如MONOPTEROS (MP), IAA12, LIKE AUXIN RESISTANT2 (LAX2), and PIN-FORMED6 (PIN6)都富集表达。GO富集分析进一步表明，该分支高度富集了生长素反应相关的生物学过程。同样，SMXL5, ALTERED PHLOEM DEVELOPMENT (APL), HIGH CAMBIAL ACTIVITY2 (HAC2/DOF5.6), and SEOR1等基因在韧皮部的拟时序轨迹上富集表达。 综上所述，这些数据表明，scRNA-seq使我们能够揭示维管组织中新的细胞类型，并揭示木质部和韧皮部分化过程中隐藏的过渡细胞状态。 3.6 茎分生组织（SMC）特性分析 通过对茎分生组织细胞类群的重新聚类与分群，最终所有细胞被分为了10个亚群。细胞周期基因分析显示SMC转录组异质性不受细胞周期状态的影响。由于表达WUS和CLV3的细胞数量较少且表达水平较低，我们结合已知OC和CZ标记基因，包括PLETHORA7 (PLT7)、REPRODUCTIVE MERISTEM1 (REM1)、AT3G59270和AT1G26680，将簇S4命名为OC和CZ区。 众所周知，STM基因在SAM中高度表达，在叶原基中受到抑制。由于STM基因不仅在SMC类群中表达而且在EC类群中也表达，作者根据这一现象认为，分化中的SAM细胞可能分布在已经分化的细胞类群中，而不是SMC类群中。作者然后把所有表达STM的细胞进行新的聚类分群，最终得到了9个细胞亚群，W0到W8。依据marker基因对每个亚群进行了注释。 转录因子在决定细胞命运中起着关键作用。STM+细胞的基因共表达分析显示，STM与KNAT1高度共表达，但与正在分化的细胞类群中富集的基因共表达系数较低。 3.7 reMC（叶肉细胞类群）特性分析除了与细胞周期相关的细胞亚群外，在reMC群体中还有7个不同的细胞亚群。遗憾的是，GO项分析和聚类特异性基因并没有识别出这些细胞亚群的任何功能。尽管人们普遍认为叶肉细胞由两种类型的细胞组成，即海绵细胞和栅栏细胞，但叶肉细胞的特性和功能比我们之前认为的要复杂得多。 3.8 单细胞分辨率下茎和根根尖组织的比较 最后，作者尝试用单细胞分辨率分析茎尖和根尖之间的保守性和分化性。如图8A所示，结合根和茎尖的scRNA-seq数据集，包括60099个细胞，显示了27个细胞类群(P0到P26)。 大多数的细胞类群几乎都是由根或茎尖细胞组成。 P22细胞群体主要由保卫细胞（GC）组成，27%的细胞来源于根。对P22类群中富集的基因的功能分析显示，*HEAT SHOCK PROTEIN (HSP)*基因的转录水平很高，这表明一些根细胞与GC具有转录组相似性，可能是因为它们对环境条件具有相同的高度敏感性质。因此，作者将P22标注为GC/HSP+。 茎尖和根尖组织共享6个维管组织细胞类群，这些共享的细胞被分为14个细胞亚群（l0到l12）。其中，l11和l12两个亚群分别由根尖细胞和茎尖细胞组成。 茎尖的表皮细胞类群(P3, P23, and P24)与根的表皮细胞类群(P14 and P20)并没有交集。但是作者发现，气生表皮的marker基因ATML1同样也在根尖的表皮细胞中表达。此外，一组参与表皮角层生物合成的基因，包括FIDDLEHEAD、FATTY ACID REDUCTASE1、GPAT4、GPAT8和3-KETOACYL-COA SYNTHASE20在茎和根的ATML1+细胞中共表达。这一结果与最近的发现一致，即在初生根尖和新生侧根中存在类角质层细胞壁结构，这也同样说明了ATML1在根表皮生物合成中发挥重要作用。综上所述，上述结果揭示了茎和根表皮之间以前未被认识到的相似性，并揭示了ATML1在根EC分化中的作用。 总结 茎尖细胞图谱的构建：茎尖和叶片的36643个细胞中鉴定出23个细胞类群，这些细胞类群最后被归为7个较为大的类群，分别是：叶肉细胞（mesophyll cell，MC）、茎尖分生组织细胞（shoot meristematic cell，SMC）、维管组织细胞（vascular cell，VC）、表皮细胞（epidermal cell，EC）、增殖细胞（proliferating cell，PC）、保卫细胞（guard cell，GC）和伴随细胞（companion cell，CC）。 细胞周期性研究：对表皮细胞类群，增殖细胞类群中的reMC和reVC两个类群的细胞周期性图谱进行探索与研究 细胞分化轨迹研究：（1）表皮细胞类群中气孔形成的分化轨迹；（2）维管组织细胞类群中，木质部与韧皮部的分化轨迹；（3）茎分生组织细胞向其他类型细胞分化过程中一些关键调控因子的鉴定。 单细胞分辨率下茎和根根尖组织的比较：（1）大部分细胞类群是相互独立的，两个组织中相似的细胞类群较少，主要集中在维管组织类群；（2）鉴定出ATML1基因在根和茎的表皮细胞中的功能。","link":"/posts/cb892386.html"}],"tags":[{"name":"博客搭建","slug":"博客搭建","link":"/tags/%E5%8D%9A%E5%AE%A2%E6%90%AD%E5%BB%BA/"},{"name":"单细胞","slug":"单细胞","link":"/tags/%E5%8D%95%E7%BB%86%E8%83%9E/"},{"name":"根","slug":"根","link":"/tags/%E6%A0%B9/"},{"name":"日常","slug":"日常","link":"/tags/%E6%97%A5%E5%B8%B8/"},{"name":"综述","slug":"综述","link":"/tags/%E7%BB%BC%E8%BF%B0/"},{"name":"愈伤","slug":"愈伤","link":"/tags/%E6%84%88%E4%BC%A4/"},{"name":"茎尖","slug":"茎尖","link":"/tags/%E8%8C%8E%E5%B0%96/"}],"categories":[{"name":"杂记","slug":"杂记","link":"/categories/%E6%9D%82%E8%AE%B0/"},{"name":"文献阅读","slug":"文献阅读","link":"/categories/%E6%96%87%E7%8C%AE%E9%98%85%E8%AF%BB/"}]}