{"pages":[{"title":"","text":"1a6f6bec81762ea439982c4bf31304be","link":"/baidu_verify_code-Bxwflx7H44.html"},{"title":"","text":"google-site-verification: googlee0783c4287f20390.html","link":"/googlee0783c4287f20390.html"},{"title":"CURRICULUM VITAE","text":"Personal InformationName: Wenkai Yan 闫文凯 Gender: Male Nationality: Chinese Data of birth: 17/10/1990 Address: College of Agriculture, Nanjing Agricultural University. No.1, Weigang, Xuanwu District, Nanjing, Jiangsu, China Mobile Phone: +86 15996238021 E-mail: 2017201007@njau.edu.cn Education2017.9-present Nanjing Agricultural University, Nanjing, China ​ Ph.D. student ​ Major: Bioinformatics 2014.9-2017.6 Nanjing Agricultural University, Nanjing, China ​ Postgraduate student ​ Major: Mathematics 2010.9-2014.6 Henan University of Science and Technology, Henan, China ​ Bachelor ​ Major: Food Science and Engineering Research Interest2017.9-present: Ph.D. research Current research contents: (1) Learn epigenetic knowledge, experimental methods, and analysis methods for NGS data; (2) Analysis the muskmelon transcriptome data and its GWAS data;(3) Learn more knowledge about machine learning, deep learning algorithms and use these algorithms to solve biological problems. 2014.9-2017.6: postgraduate research Thesis title: The study of identification pathogenic SNP based on feature selection Research contents: This paper proposes lots of methods based on feature selection algorithm, such as Random Forest algorithm, PSO-GA-SVM, to identify pathogenic SNP. These methods not only consider the main effect of the single point, but also the interaction effect between multiple sites. In addition, researchers can adjust the methods according to the demand, so our methods are flexible and extendable. Thesis title: Recognition of 16S rRNA genes in prokaryotic genomes Research contents: We constructed a 3-layer filtering model based on the three features of GC bases content of the gene sequences, 3-base periodicity and Markov chain to recognize the 16S rRNA genes from prokaryotic genomes. The specificity, sensitivity and Matthews correlation coefficients of the model were 99.58%, 91.60% and 91.49%, respectively. Experience2015.9.18-2015.9.22 National Post-Graduate Mathematical Contest in Modeling Throughout the competition process, I served as team leader. During this period, I performed the duties to organize the classmates for a variety of aspects such as experimental proposals, task assignment, data processing, and providing a pleasant environment to team members. Publications Wenkai Yan, Mingmin Xu, Guangle Zhang, Ning Qiao, Weina Xu, Yuanyuan Chen, Liangyun Zhang (2017). Recognition of 16S rRNA genes in prokaryotic genomes. Acta Microbiologica Sinica. Honors and Awards2017 PhD Degree Candidate Academic Scholarship -The second prize 2017 Excellent Postgraduate Student Cadres 2016 Master Degree Candidate Academic Scholarship -The first prize 2015 National Post-Graduate Mathematical Contest in Modeling -The third prize Professional Skills Team work spirit Good in Machine learning, Computer Programming, NGS data analysis Good in English reading, writing, speaking, and analytical thinking Proficient in statistical analysis Good in scientific writing ReferencesSupervisor: Prof. Yufeng Wu. College of agriculture, Nanjing Agricultural University, Nanjing 210095, China Email address: yfwu@njau.edu.cn Tel.(office): +86 (0)25 8439 9042 Cell phone: +86 13951855057","link":"/Resume/index.html"}],"posts":[{"title":"节日快乐","text":"背景通过翻阅各种个人博客网站搭建的资料，经过三天的学习，终于把个人的网站给搭建好了。正好今天是七夕情人节，所以在这个值得纪念的日子里发布一下本人的第一篇博客。 博主介绍 学校：南京农业大学 学院：农学院&amp;前沿交叉学院&amp;生物信息中心 年级：博士四年级 专业：生物信息学 研究方向：表观遗传学&amp;深度学习&amp;机器学习 关于个人更为详细的介绍，请期待个人的简历页面！ 目的与动机之前很长一段时间想要整理自己的以往的学习笔记和工作笔记，并且想通过互联网以博客的形式分享给他人，但是始终没有做出实际行动来。由于本人现在属于延期状态在校外住宿，加上这几天的大雨和疫情，所以我就没有去实验室工作。为了打发时间躺在床上刷起B站，偶然间翻看到搭建个人博客网页的视频，于是之前的想法又涌上心头。为了付诸实践，我果断起床打开笔记本电脑，然后按照接触到的视频查阅、整理这方面的资料。由于资金有限，最终选择了使用GitHub+Hexo的方法来搭建自己的博客网站。经过不断的尝试和调试，最终完成了之前有想法没实践的任务。 分享主题与内容我搭建个人博客所分享的主题是关于生物信息学中与我当前科研方向相关的一些生信分析实践内容和分析技巧。通过这样的形式，我可以复习一下从硕士到博士期间所学习的知识，以及整理这近七年时间的工作，然后以博客的形式分享给他人，并提供一些自己的想法与见解给读者。 鸣谢感谢第一个打赏我的人——梁旭苹同志！！！让我收到了人生中第一份打赏。","link":"/posts/1e9fcb27.html"},{"title":"个人博客的搭建教程-基于Hexo+Github","text":"一、框架简介（基于Windows系统）Hexo是高效的静态站点生成框架，它基于Node.js，能在短时间内生成静态页面，只需要通过一条指令就可以部署到GitHub或其他托管平台。Hexo的文章支持MarkDown的所有语法功能，极大简化编辑和排版过程，能够让你将精力更多的放在文章内容上。而且，Hexo支持多种多样的实用插件完善自己的站点，如评论系统、访问统计、文章加密、站内搜索、音乐插件等。 当然本教程只是初级介绍，关于该方面的知识，我也会在以后的学习工作中进行新的尝试或改进。 二、前期准备前期主要是安装Hexo、Git、Node.js、Hexo等软件以及创建GitHub仓库。 2.1 创建GitHub仓库创建仓库名字必须为用户名.github.io。如果不用此名会导致页面出现问题，尽管这个问题可以使用其他方法进行解决，但为了尽可能的简单易行，我还是建议使用如上建议的方法 注册GitHub账号 首先是注册GitHub账号，这方面内容就不过多解释了，需要注意的是一点要使用短小精悍，并且容易让别人记住的用户名，因为后面你博客网址的地址会由你的用户名组成。 创建托管博客的仓库 点击右上角的New repository ——&gt; 在新的页面中填写Repository名字：用户名.github.io，其他都是默认选项，然后点击Create repository按钮，进行提交 ——&gt;创建完成 我这里显示红色是因为我先前已经创建过了，正常情况下是绿色。 2.2. 安装GitGit是一个开源的分布式版本的控制系统，用于敏捷高效的处理各种项目。我们以此为提交工具推送构建好的页面到GitHub上去。Git的下载页面，点击这里。整个安装流程，和其他win10下的软件安装流程一样，只需要一路next即可。 当在你的windows的命令行(win+R，然后输入cmd，回车)中输入git --version ，然后出现软件版本号的时候，说明此时你已经安装成功。 2.3. 获取SSH Key该步骤相当于常见的“记住密码”选项，如跳过此步骤，每次进行推送时都要输入自己的GitHub账号和密码，会比较麻烦。 首先在本地电脑配置Git，在windows的命令行(win+R，然后输入cmd，回车)中输入以下三条命令，如下图所示： 12345# 这里需要替换成你自己的用户名和邮箱地址git config --global user.name wenkaiyan-kevingit config --global user.email 610498675@qq.com# 输入下面命令后，会让你确认三次信息，这里都选择默认即可，也就是连续按三次回车即可ssh-keygen -t rsa -C 610498675@qq.com 如果前三步都正常的话，那么会在你的C:\\Users\\wkyan\\.ssh （当然，实际情况中你需要把我的用户名wkyan替换成你的真实路径）路径下生成两个文件，分别是id_rsa和id_rsa.pub 两个文件，其中在id_rsa.pub 文件中有你的公钥，用记事本打开，然后把里面的内容全部复制。 通过以下三步，把之前复制的公钥复制进来，然后提交，完成所有任务 如果一切顺利的话，可以在命令行输入：ssh git@github.com进行测试，输出信息会显示成功字样。 2.4. 安装Node.js与HexoNode.js是底层依赖，Hexo是上层应用，这里只需要用到Node.js附带的npm包管理器，并不需要大家去学习Node.js的语法。 2.4.1 安装Node.js Node.js的下载地址请点击这里。点击安装包一路默认安装即可，可能你需要提前在你的电脑上安装python，最后在windows的命令行(win+R，然后输入cmd，回车)中输入npm -v ，然后出现软件版本号的时候，说明此时你已经安装成功。 2.4.2 安装Hexo Hexo的安装需要在windows的命令行(win+R，然后输入cmd，回车)中使用Node.js的npm包管理器进行安装。命令入下（期间会出现WARN黄色信息，这是正常现象，无需关心）： 123# hexo-cli:安装的包# -g:设置为全局变量npm install hexo-cli -g 三、搭建与发布3.1 博客初始化在本地磁盘中（不要建在桌面或者C盘）创建一个文件夹，可以命名为0_MyBlog 。接下来打开你的windows的命令行，切换至你的博客文件夹路径下，然后输入： 1hexo init 期间会出现WARN黄色信息，这是正常现象，无需关心。最后会显示Start blogging with Hexo! 3.2 本地预览同样在windows的命令行，你的博客文件夹路径下，输入以下命令： 12345# 生成静态文件hexo g# 启动本地预览服务hexo s 在本地浏览器中输入http://localhost:4000，查看当前博客状态 3.3 配置站点输入下面的命令进行推送本地文件到github仓库的配置，如果你想重新安装博客，那么这条命令需要重新安装。 12# 一定不要忘记安装在当前目录下使用命令npm install hexo-deployer-git --save 然后，就是修改当前博客下面的_config.yml文件中的配置信息 12345#####修改配置文件deploy: type: 'git' repo: 'https://github.com/wenkaiyan-kevin/wenkaiyan-kevin.github.io.git' branch: master 关于repo地址的获取，你需要登录你的github，然后进入你为博客网站新建的仓库中，按照图中所示即可获取。 3.4 推送站点最后执行完以下三条命令后，即可完成博客的构建，如果出现time out的信息，那说明你的网络速度有问题，你需要多尝试几次就好了。 123456# 清除缓存hexo clean# 生成静态网页hexo g# 把所有文档推送到github(如果是第一次，可能会输入账号密码)hexo d 然后，打开浏览器，输入https://wenkaiyan-kevin.github.io/ ，就可以让其他人访问你的网站了。 四、站点维护4.1 更换主题hexo的主题有很多，具体有哪些主题可以访问这里。以我的主题为例，如果想更换博客主题，那么只需要以下几条命令，当然执行的当前路径必须是你的博客所在路径下。 12345678# 下载安装主题npm install -S hexo-theme-icarus# 切换成安装的主题hexo config theme icarus# 重新发布hexo clean &amp;&amp; hexo g --d 4.2 发布新的博客使用MarkDown书写你的博客文档，然后复制到你本地博客文件夹的source/_posts/下面即可，然后重新发布站点 12# 重新发布hexo clean &amp;&amp; hexo g --d 4.3 图床如果是你需要图床的话，可以尝试img.chr 。 五、其他如果觉得这篇博文对你有帮助，请记得打赏，更多新鲜趣闻记得关注我的B站账号。","link":"/posts/5f29c3b4.html"}],"tags":[{"name":"日常","slug":"日常","link":"/tags/%E6%97%A5%E5%B8%B8/"},{"name":"博客搭建","slug":"博客搭建","link":"/tags/%E5%8D%9A%E5%AE%A2%E6%90%AD%E5%BB%BA/"}],"categories":[{"name":"杂记","slug":"杂记","link":"/categories/%E6%9D%82%E8%AE%B0/"}]}